import React, { useState, useEffect } from 'react'
import './priceList.scss';
import SearchIcon from "../assets/img/searchIcon.png";
import { useTranslation } from "react-i18next";

function Procelist() {
  const { t } = useTranslation();
  const [btn, setBtn] = useState('Все анализы')

  const tabs = [
    {
      title: 'Все анализы',
    }, 
    {
      title: 'Экспресс-тесты',
    }, 
    {
      title: 'Гормоны',
    }, 
    {
      title: 'Биохимия',
    },
    {
      title: 'Инфекции',
    },
    {
      title: 'Микроскопия'
    },
    {
      title: 'ПЦР'
    },
    {
      title: 'ЭКО'
    },
    {
      title: 'Аллергология'
    },
    {
      title:'Андрология'
    },
    {
      title: 'Вакцинация'
    },
    {
      title:'ЛОР'
    }
  ]

  return (
    <>

      {/* /////// Price //////// */}

      <div className="priceList_wrape">
        <div className="container-xl px-0 price">
          <div className="price_header">
            <h1>Прайс <b>лист</b> </h1>
            <div className='search_wrap d-flex'>
              <img src={SearchIcon} alt="" />
              <input type="text" placeholder='Поиск по названию' />
            </div>
          </div>
          <div className="price_body">
            <div className="price_body_inner">
              <div className="ex3">
                <div className="analz_name">
                  {tabs.map((item,i) => 
                    <button key={i} className={`tab ${item.title === btn ? 'activeTab' : null}`} onClick={() => setBtn(item.title)}>{t(`${item.title}`)}</button>
                  )}
                </div>
              </div>
            </div>
            <div className="analiz_price">
            <div className='search_wrap2 d-fle'>
              <img src={SearchIcon} alt="" />
              <input type="text" placeholder='Поиск по названию' />
            </div>
              <div className="analiz_price_header">
                <p>Название анализа</p>
                <p>Цена</p>
              </div>
              <div className="analiz_price_body">
                {btn === 'Все анализы' && <>
                  <div className="ex4">
                    <span>
                      <p>Коагулограмма</p>
                      <b>555.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>555.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>555.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>550.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                  </div>
                </>}
                {btn === 'Экспресс-тесты' && <>
                  <div className="ex4">
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                  </div>
                </>}
                {btn === 'Гормоны' && <>
                  <div className="ex4">
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                  </div>
                </>}
                {btn === 'Биохимия' && <>
                  <div className="ex4">
                    <span>
                      <p>Общая биохимия</p>
                      <b>525.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                  </div>
                </>}
                {btn === 'Инфекции' && <>
                  <div className="ex4">
                    <span>
                      <p>Общая биохимия</p>
                      <b>505.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                  </div>
                </>}
                {btn === 'Микроскопия' && <>
                  <div className="ex4">
                    <span>
                      <p>Общая биохимия</p>
                      <b>595.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                  </div>
                </>}
                {btn === 'ПЦР' && <>
                  <div className="ex4">
                    <span>
                      <p>Общая биохимия</p>
                      <b>575.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                  </div>
                </>}
                {btn === 'ЭКО' && <>
                  <div className="ex4">
                    <span>
                      <p>Общая биохимия</p>
                      <b>547.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                  </div>
                </>}
                {btn === 'Аллергология' && <>
                  <div className="ex4">
                    <span>
                      <p>Общая биохимия</p>
                      <b>535.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                  </div>
                </>}
                {btn === 'Андрология' && <>
                  <div className="ex4">
                    <span>
                      <p>Общая биохимия</p>
                      <b>542.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                  </div>
                </>}
                {btn === 'Вакцинация' && <>
                  <div className="ex4">
                    <span>
                      <p>Общая биохимия</p>
                      <b>515.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                  </div>
                </>}
                {btn === 'ЛОР' && <>
                  <div className="ex4">
                    <span>
                      <p>Общая биохимия</p>
                      <b>541.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Липидный спектр</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Коагулограмма</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Печеночные пробы</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Ферменты крови</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Диагностика гепатитов</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                    <span>
                      <p>Общая биохимия</p>
                      <b>545.000 сум</b>
                    </span>
                  </div>
                </>}
              </div>
            </div>
          </div>
        </div>
      </div>
    </>
  );
}

export default Procelist;
